import UIKit

class BooksViewController: UITableViewController {
    
    @IBOutlet var booksTableView: UITableView!
    
    private var books: [BookModel] = [
        BookModel(title: "Оян, қазақ.", author: "Дулатұлы М.", overview: "Міржақып Дулатұлы - қазақтың аса көрнекті ағартушысы, Алаш қозғалысының белсенді қайраткері, ақын, жазушы, жалынды көсемсөз шебері. Көп өлеңдерінде ол қазақ елінің отарлық езгідегі мүшкіл жайын, патша өкіметінің озбыр саясатын, әділетсіз заманның ақиқатын ашу арқылы «ел мүддесіне қызмет ету - әрбір азаматтың парызы» деген тұжырым жасайды. Бұл көзқарас Міржақып шығармаларының өн бойына тартылған өзекті желі болғаны сөзсіз. Алаштың ұлт азаттығы жолында құрбан болған күрескер ақын Міржақып Дулатұлының өлмес шығармашылық мұрасы ел мүддесіне қызмет етудің, азаматтықтың жарқын үлгісі болып қала бермек.", poster: .oyanQazaq, pageCount: 149, year: 2023, dimensions: "120x120"),
        BookModel(title: "Бақытсыз Жамал", author: "Дулатұлы М", overview: "«Бақытсыз Жамал» романы — қазақ әдебиетінде көркем прозалық үлгіде жазылған тұңғыш роман. бұл роман тек көркемдік жағынан ғана емес, тіл, форма жағынан да біраз дүниелерге сара жол болғаны анық. «Бақытсыз Жамал» романы сол кездегі тарихи-әлеуметтік шындықты шынайы да көркем бейнелеуімен, авторлық идеяның айқындығымен өзінен кейінгі қазақ прозасының өркендеуіне дәстүрлі жол көрсетті, үлгі болды.", poster: .zhamal, pageCount: 145, year: 2022, dimensions: "120x120"),
        BookModel(title: "Қара көңілім оянсын: өлеңдер мен поэмалар", author: "Абай Құнанбаев", overview: "«Сөз-маржан» сериясымен жарық көріп отырған бұл жинақта қазақ халқының ұлы ақыны Абай (Ибраһим) Құнанбайұлының өлеңдері мен поэмалары топтастырылған. Кітап көпшілік оқырманға арналған.", poster: .qaraKonil, pageCount: 200, year: 2020, dimensions: "170x170"),
        BookModel(title: "Оян, қазақ.", author: "Дулатұлы М.", overview: "Міржақып Дулатұлы - қазақтың аса көрнекті ағартушысы, Алаш қозғалысының белсенді қайраткері, ақын, жазушы, жалынды көсемсөз шебері. Көп өлеңдерінде ол қазақ елінің отарлық езгідегі мүшкіл жайын, патша өкіметінің озбыр саясатын, әділетсіз заманның ақиқатын ашу арқылы «ел мүддесіне қызмет ету - әрбір азаматтың парызы» деген тұжырым жасайды. Бұл көзқарас Міржақып шығармаларының өн бойына тартылған өзекті желі болғаны сөзсіз. Алаштың ұлт азаттығы жолында құрбан болған күрескер ақын Міржақып Дулатұлының өлмес шығармашылық мұрасы ел мүддесіне қызмет етудің, азаматтықтың жарқын үлгісі болып қала бермек.", poster: .oyanQazaq, pageCount: 149, year: 2023, dimensions: "120x120"),
        BookModel(title: "Бақытсыз Жамал", author: "Дулатұлы М", overview: "«Бақытсыз Жамал» романы — қазақ әдебиетінде көркем прозалық үлгіде жазылған тұңғыш роман. бұл роман тек көркемдік жағынан ғана емес, тіл, форма жағынан да біраз дүниелерге сара жол болғаны анық. «Бақытсыз Жамал» романы сол кездегі тарихи-әлеуметтік шындықты шынайы да көркем бейнелеуімен, авторлық идеяның айқындығымен өзінен кейінгі қазақ прозасының өркендеуіне дәстүрлі жол көрсетті, үлгі болды.", poster: .zhamal, pageCount: 145, year: 2022, dimensions: "120x120"),
        BookModel(title: "Қара көңілім оянсын: өлеңдер мен поэмалар", author: "Абай Құнанбаев", overview: "«Сөз-маржан» сериясымен жарық көріп отырған бұл жинақта қазақ халқының ұлы ақыны Абай (Ибраһим) Құнанбайұлының өлеңдері мен поэмалары топтастырылған. Кітап көпшілік оқырманға арналған.", poster: .qaraKonil, pageCount: 200, year: 2020, dimensions: "170x170"),
        BookModel(title: "Оян, қазақ.", author: "Дулатұлы М.", overview: "Міржақып Дулатұлы - қазақтың аса көрнекті ағартушысы, Алаш қозғалысының белсенді қайраткері, ақын, жазушы, жалынды көсемсөз шебері. Көп өлеңдерінде ол қазақ елінің отарлық езгідегі мүшкіл жайын, патша өкіметінің озбыр саясатын, әділетсіз заманның ақиқатын ашу арқылы «ел мүддесіне қызмет ету - әрбір азаматтың парызы» деген тұжырым жасайды. Бұл көзқарас Міржақып шығармаларының өн бойына тартылған өзекті желі болғаны сөзсіз. Алаштың ұлт азаттығы жолында құрбан болған күрескер ақын Міржақып Дулатұлының өлмес шығармашылық мұрасы ел мүддесіне қызмет етудің, азаматтықтың жарқын үлгісі болып қала бермек.", poster: .oyanQazaq, pageCount: 149, year: 2023, dimensions: "120x120"),
        BookModel(title: "Бақытсыз Жамал", author: "Дулатұлы М", overview: "«Бақытсыз Жамал» романы — қазақ әдебиетінде көркем прозалық үлгіде жазылған тұңғыш роман. бұл роман тек көркемдік жағынан ғана емес, тіл, форма жағынан да біраз дүниелерге сара жол болғаны анық. «Бақытсыз Жамал» романы сол кездегі тарихи-әлеуметтік шындықты шынайы да көркем бейнелеуімен, авторлық идеяның айқындығымен өзінен кейінгі қазақ прозасының өркендеуіне дәстүрлі жол көрсетті, үлгі болды.", poster: .zhamal, pageCount: 145, year: 2022, dimensions: "120x120"),
        BookModel(title: "Қара көңілім оянсын: өлеңдер мен поэмалар", author: "Абай Құнанбаев", overview: "«Сөз-маржан» сериясымен жарық көріп отырған бұл жинақта қазақ халқының ұлы ақыны Абай (Ибраһим) Құнанбайұлының өлеңдері мен поэмалары топтастырылған. Кітап көпшілік оқырманға арналған.", poster: .qaraKonil, pageCount: 200, year: 2020, dimensions: "170x170"),
        BookModel(title: "Оян, қазақ.", author: "Дулатұлы М.", overview: "Міржақып Дулатұлы - қазақтың аса көрнекті ағартушысы, Алаш қозғалысының белсенді қайраткері, ақын, жазушы, жалынды көсемсөз шебері. Көп өлеңдерінде ол қазақ елінің отарлық езгідегі мүшкіл жайын, патша өкіметінің озбыр саясатын, әділетсіз заманның ақиқатын ашу арқылы «ел мүддесіне қызмет ету - әрбір азаматтың парызы» деген тұжырым жасайды. Бұл көзқарас Міржақып шығармаларының өн бойына тартылған өзекті желі болғаны сөзсіз. Алаштың ұлт азаттығы жолында құрбан болған күрескер ақын Міржақып Дулатұлының өлмес шығармашылық мұрасы ел мүддесіне қызмет етудің, азаматтықтың жарқын үлгісі болып қала бермек.", poster: .oyanQazaq, pageCount: 149, year: 2023, dimensions: "120x120"),
        BookModel(title: "Бақытсыз Жамал", author: "Дулатұлы М", overview: "«Бақытсыз Жамал» романы — қазақ әдебиетінде көркем прозалық үлгіде жазылған тұңғыш роман. бұл роман тек көркемдік жағынан ғана емес, тіл, форма жағынан да біраз дүниелерге сара жол болғаны анық. «Бақытсыз Жамал» романы сол кездегі тарихи-әлеуметтік шындықты шынайы да көркем бейнелеуімен, авторлық идеяның айқындығымен өзінен кейінгі қазақ прозасының өркендеуіне дәстүрлі жол көрсетті, үлгі болды.", poster: .zhamal, pageCount: 145, year: 2022, dimensions: "120x120"),
        BookModel(title: "Қара көңілім оянсын: өлеңдер мен поэмалар", author: "Абай Құнанбаев", overview: "«Сөз-маржан» сериясымен жарық көріп отырған бұл жинақта қазақ халқының ұлы ақыны Абай (Ибраһим) Құнанбайұлының өлеңдері мен поэмалары топтастырылған. Кітап көпшілік оқырманға арналған.", poster: .qaraKonil, pageCount: 200, year: 2020, dimensions: "170x170")
    ]
    
    private var selectedBook: BookModel?
    
    override func viewDidLoad() {
        super.viewDidLoad()
        booksTableView.dataSource = self
    }

    override func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return books.count
    }
    
    override func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        let cell = tableView
            .dequeueReusableCell(withIdentifier: "BookCell", for: indexPath) as! BookCell
        let book = books[indexPath.row]
        cell.configure(with: book)
        return cell
    }
    
    override func tableView(_ tableView: UITableView, didSelectRowAt indexPath: IndexPath) {
        selectedBook = books[indexPath.row]
        performSegue(withIdentifier: "goToBookDetails", sender: nil)
        tableView.deselectRow(at: indexPath, animated: true)
    }
    
    override func prepare(for segue: UIStoryboardSegue, sender: Any?) {
        guard let destVC = segue.destination as? BookDetailViewController else {
            return
        }
        destVC.configure(with: selectedBook)
    }

}
